Devcamp/app/controllers/blogs_controller.rb

  def index
    if logged_in?(:site_admin)
      @blogs = Blog.recent.page(params[:page]).per(5)
---
SELECT "blogs".* FROM "blogs"

  def show
    if logged_in?(:site_admin) || @blog.published?
      @blog = Blog.includes(:comments).friendly.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    respond_to do |format|
      if @blog.update(blog_params)
---
UPDATE "blogs" SET "title" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3  [["title", "Landon Dance"], ["updated_at", "2017-06-13 17:31:23.593434"], ["id", 1]]